Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Configuration reference documentation is generated from Javadoc comments discovered in MicroProfile Config source files. These generated files are in `target/asciidoc/generated/config/` (from the project root).
ja_jp: 設定リファレンスドキュメントは、MicroProfile Config ソースファイルで発見された Javadoc コメントから生成されます。これらの生成されたファイルは（プロジェクトルートから相対で） `target/asciidoc/generated/config/` にあります。

source: Configuration references
ja_jp: 設定リファレンス

source: Configuration roots are configuration groups that appear in the root of the configuration tree. A configuration property's full name is determined by joining the string `quarkus.` with the hyphenated name of the fields that form the path from the root to the leaf field. For example, if I define a configuration root group called `ThreadPool`, with a nested group in a field named `sizing` that in turn contains a field called `minSize`, the final configuration property will be called `quarkus.thread-pool.sizing.min-size`.
ja_jp: 設定ルートは、設定ツリーのルートに表示される設定グループです。設定プロパティーのフルネームは、 `quarkus.` の文字列を、ルートからリーフフィールドへのパスを形成するフィールドのハイフンでつながれた名前と結合することによって決定されます。たとえば、 `ThreadPool` という設定ルートグループを定義し、その中に `sizing` という名前のフィールドにネストされたグループがあり、そこには `minSize` と呼ばれるフィールドが含まれる場合、最終的な設定プロパティーは `quarkus.thread-pool.sizing.min-size` と呼ばれます。

source: Configuration roots are strictly bound by configuration phase, and attempting to access a configuration root from outside of its corresponding phase will result in an error. A configuration root dictates when its contained keys are read from configuration, and when they are available to applications. The phases defined by `io.quarkus.runtime.annotations.ConfigPhase` are as follows:
ja_jp: 設定ルートは設定フェーズによって厳密に決定され、対応するフェーズの外から設定ルートにアクセスしようとするとエラーになります。設定ルートは、含まれるキーが設定から読み込まれるタイミングと、アプリケーションが利用できるタイミングを決定します。 `io.quarkus.runtime.annotations.ConfigPhase` で定義されているフェーズは以下のとおりです。

source: Configuration support
ja_jp: 設定サポート

source: Configuration tracker could be instructed to exclude some of the options from the report by configuring `quarkus.config-tracking.exclude` with a comma-separated list of configuration option names that should be filtered out.
ja_jp: 除外する設定オプション名のコンマ区切りリストを使用して `quarkus.config-tracking.exclude` を設定することで、設定トラッカーにレポートから一部のオプションを除外するように指示できます。

source: Configuration values are always collected into grouping classes which are marked with the `@io.quarkus.runtime.annotations.ConfigGroup` annotation. These classes contain a field for each key within its group. In addition, configuration groups can be nested.
ja_jp: 設定値は常に、 `@io.quarkus.runtime.annotations.ConfigGroup` アノテーションでマークされたグループ化クラスに収集されます。これらのクラスには、グループ内の各キーのフィールドが含まれています。さらに、設定グループをネストすることができます。

source: Configuration values can be hashed using `SHA-512` algorithm before they are written to a file. Configuration option names whose values should be hashed can be configured in `quarkus.config-tracking.hash-options` as a comma separated list.
ja_jp: 設定値は、ファイルに書き込まれる前に `SHA-512` アルゴリズムを使用してハッシュ化できます。値をハッシュ化する必要がある設定オプション名は、 `quarkus.config-tracking.hash-options` でコンマ区切りのリストとして設定できます。

source: Configuration via Gradle project properties (for example `./gradlew -Pquarkus.package.jar.type=fast-jar`)
ja_jp: Gradle プロジェクトプロパティによる設定 (例: `./gradlew -Pquarkus.package.jar.type=fast-jar`)

source: Configuration via Gradle project properties (for example `./gradlew -Pquarkus.package.type=fast-jar`)
ja_jp: Gradleプロジェクトプロパティによる設定（例： `./gradlew -Pquarkus.package.type=fast-jar` )

source: Configuration via an application-supplied subclass of `Application` is supported but not required.
ja_jp: アプリケーションが提供する `Application` のサブクラスによる設定もサポートされていますが、必須ではありません。

source: Configuration via an application-supplied subclass of `Application` is supported, but not required.
ja_jp: `Application` のアプリケーションが提供するサブクラスによる設定もサポートされていますが、必須ではありません。

source: Configuration via the `quarkus` extensions's `quarkusBuildProperties` For example:
ja_jp: `quarkus` エクステンションの `quarkusBuildProperties` を介した設定。 例えば:

source: Configure CDI Beans with parsed arguments
ja_jp: 解析された引数での CDI Beans の設定

source: Configure Hibernate Search for the `inventory` persistence unit, setting the Elasticsearch host for that persistence unit to `es2.mycompany.com:9200`.
ja_jp: `inventory` 永続化ユニットにHibernate Searchを設定し、その永続化ユニットのElasticsearchホストを `es2.mycompany.com:9200` に設定します。

source: Configure Hibernate Search for the `users` persistence unit, setting the Elasticsearch host for that persistence unit to `es1.mycompany.com:9200`.
ja_jp: `users` 永続化ユニットにHibernate Searchを設定し、その永続化ユニットのElasticsearchホストを `es1.mycompany.com:9200` に設定します。

source: Configure OIDC in the Quarkus `application.properties` file by using the properties from the Auth0 application that you created earlier.
ja_jp: 前の手順で作成した Auth0 アプリケーションのプロパティーを使用して、Quarkus の `application.properties` ファイルで OIDC を設定します。

source: Configure Quarkus properties
ja_jp: Quarkus のプロパティーを設定する

source: Configure Redis hosts programmatically
ja_jp: プログラムでRedisホストを設定

source: Configure Redis hosts to connect to. Here we connect to the Redis server we started in the previous section
ja_jp: 接続先のRedisホストを設定します。ここでは、前のセクションで開始したRedisサーバーに接続します。

source: Configure Redis observability
ja_jp: Redisのオブザーバビリティの設定

source: Configure Stork observability
ja_jp: Stork のオブザーバビリティの設定

source: Configure Wiremock to stub the calls to `/extensions?id=io.quarkus:quarkus-rest-client` by returning a specific canned response.
ja_jp: `/extensions?id=io.quarkus:quarkus-rest-client` への呼び出しに対して特定のレスポンスを返すよう、Wiremock のスタブを設定します。

source: Configure Wiremock to stub the calls to `/introspect` by returning an OAuth2 introspect response. You need to customize this line to return what's needed for your application (at least the scope property as roles are derived from the scope).
ja_jp: OAuth2のイントロスペクトレスポンスを返すことで、 `/introspect` への呼び出しをスタブ化するように Wiremock を設定します。この行をカスタマイズして、アプリケーションに必要なものを返すようにする必要があります (ロールはスコープから派生しているので、少なくともスコープのプロパティーは必要です)。

source: Configure a JDBC datasource
ja_jp: JDBC データソースの設定

source: Configure a reactive datasource
ja_jp: Reactiveデータソースの設定

source: Configure a single datasource
ja_jp: 単一のデータソースの設定

source: Configure an external database using a profile
ja_jp: プロファイルを使用して外部データベースを設定

source: Configure and manage multiple WebAssembly modules.
ja_jp: 複数の WebAssembly モジュールを構成および管理します。

source: Configure and start the https://opentelemetry.io/docs/collector/[OpenTelemetry Collector] to receive, process and export telemetry data to https://www.jaegertracing.io/[Jaeger] that will display the captured traces.
ja_jp: https://opentelemetry.io/docs/collector/[OpenTelemetry Collector] を設定して起動し、テレメトリーデータを受信、処理、およびエクスポートして、キャプチャされたトレースを https://www.jaegertracing.io/[Jaeger] に表示できるようにします。

source: Configure at least one data source in the `application.properties` file so the `quarkus-security-jpa` extension can access your database. For example:
ja_jp: `quarkus-security-jpa` エクステンションがデータベースにアクセスできるように、 `application.properties` ファイルで少なくとも 1 つのデータソースを設定します。 以下に例を示します。

source: Configure at least one data source in the `src/main/resources/application.properties` file so the `quarkus-security-jpa` extension can access your database. For example:
ja_jp: `quarkus-security-jpa` エクステンションがデータベースにアクセスできるように、 `src/main/resources/application.properties` ファイルで少なくとも 1 つのデータソースを設定します。 例:

source: Configure at least one data source so that the `security-jpa` extension can access your database.
ja_jp: 少なくとも1つのデータソースを設定し、 `security-jpa` エクステンションがデータベースにアクセスできるようにします。

source: Configure connection with Infinispan server
ja_jp: Infinispan サーバーとの接続を設定する

source: Configure custom Dev Services using Docker or Podman Compose.
ja_jp: Docker または Podman Compose を使用してカスタム Dev Services を設定します。

source: Configure data sources in Quarkus
ja_jp: Quarkusでデータソースを設定

source: Configure database access properties
ja_jp: データベースアクセスプロパティの設定

source: Configure datasources
ja_jp: データソースの設定

source: Configure it in your build tool as follows:
ja_jp: ビルドツールで次のように設定します。

source: Configure it to point to a Keycloak SAML broker endpoint.
ja_jp: Keycloak SAML ブローカーエンドポイントを指すように設定します。

source: Configure logging for `@QuarkusTest`
ja_jp: `@QuarkusTest` のロギング設定

source: Configure multiple datasources
ja_jp: 複数のデータソースの設定

source: Configure our WebSocket server with the supported sub-protocols. When the WebSocket client provides a lists of supported sub-protocols in the HTTP `Sec-WebSocket-Protocol` request header, the WebSocket server must agree to serve content with one of them.
ja_jp: サポートされているサブプロトコルを使用して、WebSocket サーバーを設定します。WebSocket クライアントが HTTP `Sec-WebSocket-Protocol` リクエストヘッダーでサポートされているサブプロトコルのリストを提供する場合、WebSocket サーバーはそれらのいずれかを使用してコンテンツを提供することに同意する必要があります。

source: Configure push notification endpoints
ja_jp: プッシュ通知エンドポイントの設定

source: Configure redirect URLs. Slack provider requires HTTPS protocol, for development purposes, you can use ngrok:
ja_jp: リダイレクト URL を設定します。 Slack プロバイダーには HTTPS プロトコルが必要です。開発目的では ngrok を使用できます。

source: Configure storing of Quarkus transaction logs in a database
ja_jp: Quarkusのトランザクションログをデータベースに保存する設定

source: Configure tenant paths
ja_jp: テナントパスの設定

source: Configure the Artemis properties
ja_jp: Artemisのプロパティーの設定

source: Configure the Credentials Provider to obtain the username and password for the proxy.
ja_jp: プロキシーのユーザー名とパスワードを取得するように Credentials Provider を設定します。

source: Configure the GELF log handler to send logs to an external UDP endpoint on port 12201:
ja_jp: ポート 12201 の外部 UDP エンドポイントにログを送信するように GELF ログハンドラーを設定します。

source: Configure the GELF log handler to send logs to an external UDP endpoint on the port 12201:
ja_jp: GELF ログハンドラーを構成して、ポート 12201 の外部 UDP エンドポイントにログを送信します。

source: Configure the HTTPS port
ja_jp: HTTP ポートの設定

source: Configure the Infinispan backend
ja_jp: Infinispan バックエンドの設定

source: Configure the JDBC connection
ja_jp: JDBC 接続を設定する

source: Configure the JDBC connection by defining the JDBC URL property:
ja_jp: JDBC URL プロパティーを定義して、JDBC 接続を構成します:

source: Configure the JSON logging extension using supported properties to customize its behavior.
ja_jp: サポートされているプロパティを使用してJSONロギングエクステンションを設定し、その動作をカスタマイズしてください。

source: Configure the Kafka bootstrap location, so the application connects to this broker.
ja_jp: アプリケーションがこのブローカーに接続するように、Kafka ブートストラップの場所を設定します。

source: Configure the Keycloak Admin Client to use the same port
ja_jp: 同じポートを使用するようにKeycloak Admin Clientを設定します。

source: Configure the Keycloak container to listen on the `45180` port by default
ja_jp: デフォルトで `45180` ポートをリッスンするようにKeycloakコンテナを設定します。

source: Configure the Maven Surefire plugin as follows (and similarly the Maven Failsafe plugin when testing in native image):
ja_jp: Maven Surefire プラグインを次のように設定します (ネイティブイメージでテストする場合は Maven Failsafe プラグインも同様に設定します)。

source: Configure the Maven Surefire plugin as follows, or similarly with `maven.failsafe.plugin` for native image testing:
ja_jp: Maven Surefire プラグインを次のように設定します。または、ネイティブイメージテストの `maven.failsafe.plugin` と同様に設定します。

source: Configure the OpenShift Application Manually
ja_jp: OpenShift アプリケーションを手動で設定する

source: Configure the OpenTelemetry Collector by creating an `otel-collector-config.yaml` file:
ja_jp: `otel-collector-config.yaml` ファイルを作成して OpenTelemetry Collector を設定します。

source: Configure the Pulsar broker service url for the production profile. You can configure it globally or per channel using `mp.messaging.incoming.$channel.serviceUrl` property. In dev mode and when running tests, <<pulsar-dev-services>> automatically starts a Pulsar broker.
ja_jp: プロダクションプロファイルの Pulsar ブローカーサービス URL を設定します。 この URL は、 `mp.messaging.incoming.$channel.serviceUrl` プロパティーを使用して、グローバルに、またはチャネルごとに設定できます。 開発モードおよびテスト実行時には、<<pulsar-dev-services>> が Pulsar ブローカーを自動的に起動します。

source: Configure the Pulsar broker service url.
ja_jp: Pulsar ブローカーサービスの URL を設定します。

source: Configure the Qpid JMS properties
ja_jp: Qpid JMSのプロパティーの設定

source: Configure the Quarkus OIDC `web-app` application to point to the Keycloak `quarkus` realm, `quarkus.oidc.auth-server-url=http://localhost:8180/realms/quarkus`.
ja_jp: Quarkus OIDC の `web-app` アプリケーションを、Keycloak の `quarkus` レルム (`quarkus.oidc.auth-server-url=http://localhost:8180/realms/quarkus`) を指すように設定します。

source: Configure the Quarkus OpenID Connect (OIDC) extension by setting the following configuration properties in the `src/main/resources/application.properties` file.
ja_jp: `src/main/resources/application.properties` ファイルで次の設定プロパティーを設定して、Quarkus OpenID Connect (OIDC) エクステンションを設定します。

source: Configure the REST client to trust the CA certificate generated by OpenShift:
ja_jp: OpenShift によって生成された CA 証明書を信頼するように REST クライアントを設定します。

source: Configure the REST client to use this CA certificate.
ja_jp: この CA 証明書を使用するように REST クライアントを設定します。

source: Configure the Redis backend
ja_jp: Redisのバックエンドの設定

source: Configure the Redis key
ja_jp: Redisキーの設定

source: Configure the TLS registry to use the certificates:
ja_jp: 証明書を使用するように TLS レジストリーを設定します。

source: Configure the Vert.x instance
ja_jp: Vert.xインスタンスの設定

source: Configure the `github-api-client` REST Client base URL.
ja_jp: `github-api-client` REST クライアントのベース URL を設定します。

source: Configure the `hero` REST client with the TLS configuration named `my-service-tls`.
ja_jp: `my-service-tls` という名前の TLS 設定を使用して、`hero` REST クライアントを設定します。

source: Configure the `pom.xml` file:
ja_jp: `pom.xml` ファイルを設定します：

source: Configure the `quarkus.oidc.token-state-manager.encryption-secret` property if Quarkus authenticates to the OIDC provider by using one of the following authentication methods:
ja_jp: Quarkus が次のいずれかの認証方法を使用して OIDC プロバイダーに対して認証する場合は、 `quarkus.oidc.token-state-manager.encryption-secret` プロパティーを設定します。

source: Configure the address
ja_jp: アドレスの設定

source: Configure the application
ja_jp: アプリケーションの設定

source: Configure the application to use the discovered service
ja_jp: 検出されたサービスを使用するようにアプリケーションを構成します

source: Configure the authentication
ja_jp: 認証の設定

source: Configure the base URI and the configuration key. The name must be in the format `<service-name>.<namespace>.svc`. Otherwise, the certificate will not be trusted. Ensure that the `configKey` is also configured.
ja_jp: ベース URI と設定鍵を設定します。 名前は、 `<service-name>.<namespace>.svc` フォーマットにします。 そうでない場合、証明書は信頼されません。 `configKey` も設定されていることを確認してください。

source: Configure the base URI and the configuration key. The name must be in the format `<service-name>.<namespace>.svc`. Otherwise, the certificate will not be trusted. Ensure that the `configKey` is configured as well.
ja_jp: ベース URI と設定キーを設定します。名前は `<service-name>.<namespace>.svc` 形式にする必要があります。そうでない場合、証明書は信頼されません。 `configKey` も設定されていることを確認してください。

source: Configure the broker location for the production profile. You can configure it globally or per channel using `mp.messaging.incoming.$channel.bootstrap.servers` property. In dev mode and when running tests, <<kafka-dev-services>> automatically starts a Kafka broker. When not provided this property defaults to `localhost:9092`.
ja_jp: プロダクションプロファイルのブローカーの場所を設定します。 `mp.messaging.incoming.$channel.bootstrap.servers` プロパティーを使用して、グローバルまたはチャネルごとに設定できます。 開発モードとテスト実行時には、<<kafka-dev-services>> が自動的に Kafka ブローカーを開始します。 指定しない場合、このプロパティーのデフォルトは `localhost:9092` になります。

source: Configure the broker location for the production profile. You can configure it globally or per channel using `mp.messaging.outgoing.$channel.bootstrap.servers` property. In dev mode and when running tests, <<kafka-dev-services>> automatically starts a Kafka broker. When not provided, this property defaults to `localhost:9092`.
ja_jp: プロダクションプロファイルのブローカーの場所を設定します。 `mp.messaging.outgoing.$channel.bootstrap.servers` プロパティーを使用して、グローバルまたはチャネルごとに設定できます。 開発モードとテスト実行時には、<<kafka-dev-services>> が自動的に Kafka ブローカーを開始します。 指定しない場合、このプロパティーのデフォルトは `localhost:9092` になります。

source: Configure the connection to the managed database:
ja_jp: マネージドデータベースへの接続を設定します:

source: Configure the connector to manage the `prices-out` channel.
ja_jp: `prices-out` チャネルを管理するためのコネクターを設定します。

source: Configure the connector to manage the prices channel. By default, the _topic_ name is same as the channel name.
ja_jp: prices チャネルを管理するためのコネクターを設定します。 デフォルトでは、_トピック_ 名はチャネル名と同じです。

source: Configure the connector to manage the prices channel. By default the topic name is same as the channel name. You can configure the topic attribute to override it.
ja_jp: 価格チャネルを管理するためのコネクタを設定します。デフォルトでは、トピック名はチャネル名と同じです。トピック属性で上書きするように設定できます。

source: Configure the connector to manage the prices channel. By default, the topic name is same as the channel name. You can configure the topic attribute to override it.
ja_jp: prices チャネルを管理するようにコネクターを設定します。デフォルトでは、トピック名はチャネル名と同じです。トピック属性を設定することで、それを上書きすることができます。

source: Configure the default `datacontenttype` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `datacontenttype` attribute itself Type: _string_
ja_jp: outgoing Cloud Eventのデフォルトの `datacontenttype` 属性を設定します。 `cloud-events` に `true` を設定する必要があります。この値は、メッセージが `datacontenttype` 属性を設定していない場合に使用されます。 タイプ: _string_

source: Configure the default `dataschema` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `dataschema` attribute itself Type: _string_
ja_jp: outgoing Cloud Eventのデフォルトの `dataschema` 属性を設定します。 `cloud-events` に `true` を設定する必要があります。この値は、メッセージが `dataschema` 属性を設定していない場合に使用されます。 タイプ: _string_

source: Configure the default `source` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `source` attribute itself Type: _string_
ja_jp: outgoing Cloud Eventのデフォルトの `source` 属性を設定します。 `cloud-events` に `true` を設定する必要があります。この値は、メッセージが `source` 属性を設定していない場合に使用されます。 タイプ: _string_

source: Configure the default `subject` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `subject` attribute itself Type: _string_
ja_jp: outgoing Cloud Eventのデフォルトの `subject` 属性を設定します。 `cloud-events` に `true` を設定する必要があります。この値は、メッセージが `subject` 属性を設定していない場合に使用されます。 タイプ: _string_

source: Configure the default `type` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `type` attribute itself Type: _string_
ja_jp: outgoing Cloud Eventのデフォルトの `type` 属性を設定します。 `cloud-events` に `true` を設定する必要があります。この値は、メッセージが `type` 属性を設定していない場合に使用されます。 タイプ: _string_

source: Configure the following properties to define credentials:
ja_jp: 以下のプロパティーを設定し、クレデンシャルを定義します：

source: Configure the host, port and scheme
ja_jp: ホスト、ポート、スキームの設定

source: Configure the level from the `application.properties` file:
ja_jp: `application.properties` ファイルからレベルを設定します。

source: Configure the load scripts
ja_jp: ロードスクリプトの設定

source: Configure the log format to use `%X\{mdc-key\}`:
ja_jp: ログ形式を `%X \{mdc-key\}` を使用するように設定します。

source: Configure the log level, category, and format
ja_jp: ログレベル、カテゴリー、フォーマットの設定

source: Configure the name of the secret that will be used. This doesn't need to be prefixed with the `%prod` profile as it won't have any effect if secret reading is disabled.
ja_jp: 使用されるSecretsの名前を設定します。Secretsの読み取りが無効になっている場合は何の効果もありませんので、この名前の前に `%prod` プロファイルを付ける必要はありません。

source: Configure the path to handle GET request on `/mail/reactive`. Note that because we are using the reactive API, we don't need `@Blocking`
ja_jp: `/mail/reactive` への GET リクエストを処理するためのパスを設定します。なお、ここではリアクティブAPIを使用しているため、 `@Blocking` は必要ありません。

source: Configure the port to serve HTTPS.
ja_jp: HTTPS を提供するポートを設定します。

source: Configure the pre-loading
ja_jp: プリロードの設定

source: Configure the quarkus extension plugin version
ja_jp: quarkusエクステンションプラグインのバージョン設定

source: Configure the reactive datasource
ja_jp: リアクティブデータソースの構成

source: Configure the root path
ja_jp: ルートパスの設定

source: Configure the root path of our HTTP endpoint
ja_jp: HTTPエンドポイントのルートパスの設定

source: Configure the runtime environment. Set `GRAALVM_HOME` environment variable to the GraalVM installation directory, for example:
ja_jp: ランタイム環境を構成します。 `GRAALVM_HOME` 環境変数をGraalVMインストールディレクトリに設定します。例えば:

source: Configure the runtime logging in the `application.properties` file.
ja_jp: `application.properties` ファイルで実行時ロギングを設定してください。

source: Configure the upper limit on deflated request body. This is useful to mitigate potential attacks by limiting their reach. The default value is `10M`. This configuration option would recognize strings in this format (shown as a regular expression): `[0-9]+[KkMmGgTtPpEeZzYy]?`. If no suffix is given, assume bytes.
ja_jp: デフレーションされたリクエストボディの上限を設定します。これは、リーチを制限することで潜在的な攻撃を緩和するのに便利です。既定値は `10M` です。この設定オプションは、以下の形式の文字列を認識します(正規表現で表示されます): `[0-9]+[KkMmGgTtPpEeZzYy]?` .サフィックスが指定されていない場合は、バイトとみなします。

source: Configure the upper limit on the deflated request body. This is useful to mitigate potential attacks by limiting their reach. The default value is `10M`. This configuration option would recognize strings in this format (shown as a regular expression): `[0-9]+[KkMmGgTtPpEeZzYy]?`. If no suffix is given, assume bytes.
ja_jp: 圧縮されたリクエストボディーの上限を設定します。 これは、攻撃の範囲を制限することで潜在的な攻撃を軽減するのに役立ちます。デフォルト値は `10M` です。 この設定オプションは、`[0-9]+[KkMmGgTtPpEeZzYy]?` というフォーマット (正規表現として表示) の文字列を認識します。 接尾辞が指定されていない場合は、バイトであると想定されます。

source: Configure traffic shaping
ja_jp: トラフィックシェーピングの設定

source: Configure trusted proxy with the IP address `127.0.0.1`. Request headers from any other address are going to be ignored.
ja_jp: 信頼できるプロキシをIPアドレス `127.0.0.1` で設定します。それ以外のアドレスからのリクエストヘッダーは無視されます。

source: Configure xref:flyway.adoc[Flyway] for database initialization for tenant `base`, because schema generation by Hibernate ORM is not supported in this case.
ja_jp: この場合、Hibernate ORM によるスキーマ生成はサポートされていないため、 テナント `base` のデータベース初期化用に xref:flyway.adoc[Flyway] を設定します。

source: Configure xref:flyway.adoc[Flyway] for database initialization for tenant `mycompany`, because schema generation by Hibernate ORM is not supported in this case.
ja_jp: この場合、Hibernate ORM によるスキーマ生成はサポートされていないため、 テナント `mycompany` のデータベース初期化用に xref:flyway.adoc[Flyway] を設定します。

source: Configure xref:flyway.adoc[Flyway] for database initialization, because schema generation by Hibernate ORM is not supported in this case.
ja_jp: この場合、Hibernate ORM によるスキーマ生成がサポートされていないため、 xref:flyway.adoc[Flyway] をデータベースの初期化用に設定します。

source: Configure your JDBC datasource:
ja_jp: JDBC データソースを設定します：

source: Configure your datasource
ja_jp: データソースの設定

source: Configure your extension to use the link:https://github.com/quarkusio/quarkus-ecosystem-ci#quarkus-ecosystem-ci[Quarkus Ecosystem CI] to build against the latest Quarkus Core changes;
ja_jp: link:https://github.com/quarkusio/quarkus-ecosystem-ci#quarkus-ecosystem-ci[Quarkus エコシステム CI] を使用して、最新の Quarkus Core の変更に対応してビルドするようにエクステンションを設定します。

source: Configure your reactive datasource:
ja_jp: リアクティブデータソースを設定します：

source: Configured paths, like the `dev` endpoint used by the console or the SmallRye OpenAPI path shown in the example above, need to be properly resolved against both `quarkus.http.root-path` and `quarkus.http.non-application-root-path`. Use `NonApplicationRootPathBuildItem` or `HttpRootPathBuildItem` to construct endpoint routes and identify resolved path values that can then be used in templates.
ja_jp: コンソールで使用される `dev` エンドポイントや、上記の例で示されている SmallRye OpenAPI パスなどの設定されたパスは、 `quarkus.http.root-path` と `quarkus.http.non-application-root-path` の両方に対して適切に解決される必要があります。 `NonApplicationRootPathBuildItem` または `HttpRootPathBuildItem` を使用してエンドポイントのルートを構築し、テンプレートで使用できる解決済みのパス値を特定します。

source: Configures Dev Services to import a specified realm file, effective only in dev mode and not in JVM or native modes.
ja_jp: 指定されたレルムファイルをインポートするように Dev Services を設定します。これは開発モードでのみ有効で、JVM モードやネイティブモードでは有効ではありません。
